In [4]:
import pandas as pd

In [64]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [18]:
#order.head()

In [17]:
user_cols = ['user_id','age','gender','occupation','zip_code']
movie = pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=user_cols)

# How do I select pandas seriers

In [22]:
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [26]:
type(ufo['City'])

pandas.core.series.Series

In [27]:
'ab' + 'cd'

'abcd'

In [30]:
type(ufo.City + ", " + ufo.State)

pandas.core.series.Series

In [31]:
ufo['Location'] = ufo.City + ", " + ufo.State

In [39]:
movie.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [41]:
movie.shape

(943, 5)

In [45]:
movie.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# How to rename columes

In [47]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [48]:
ufo.columns

Index([u'City', u'Colors Reported', u'Shape Reported', u'State', u'Time'], dtype='object')

In [52]:
ufo.rename(columns = {'Colors Reported':'Colors_Reported'}).columns

Index([u'City', u'Colors_Reported', u'Shape Reported', u'State', u'Time'], dtype='object')

In [53]:
ufo_cols = ['city','color','shape','state','time']

In [54]:
ufo.columns  = ufo_cols

In [ ]:
ufo = pd.read_csv('http://bit.ly/uforeports',names = ufo_cols,header=0)

In [55]:
ufo.columns = ufo.columns.str.replace(' ','_')

In [56]:
ufo.columns

Index([u'city', u'color', u'shape', u'state', u'time'], dtype='object')

# How do I remove columns

In [57]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [58]:
ufo.drop('Colors Reported',axis = 1,inplace=True)

In [59]:
ufo.columns

Index([u'City', u'Shape Reported', u'State', u'Time'], dtype='object')

In [ ]:
ufo.drop(['City','State'],axis = 1,inplace=True)

In [60]:
ufo.drop([0,1],axis=0,inplace=True)

In [61]:
ufo.shape

(18239, 4)

# How to apply filter

In [67]:
movies[movies.duration >= 200].title

2                             The Godfather: Part II
7      The Lord of the Rings: The Return of the King
17                                     Seven Samurai
78                       Once Upon a Time in America
85                                Lawrence of Arabia
142                Lagaan: Once Upon a Time in India
157                               Gone with the Wind
204                                          Ben-Hur
445                             The Ten Commandments
476                                           Hamlet
630                                        Malcolm X
767                  It's a Mad, Mad, Mad, Mad World
Name: title, dtype: object

In [73]:
movies[(movies.duration >= 200) & (movies.genre == 'Drama')].title

17          Seven Samurai
157    Gone with the Wind
476                Hamlet
Name: title, dtype: object

In [77]:
movies[movies.genre.isin(['Crime','Drama','Action'])].shape

(538, 6)

# Read specific rows & Column

In [78]:
pd.read_csv('http://bit.ly/imdbratings',usecols=[0,4]).shape

(979, 2)

In [79]:
pd.read_csv('http://bit.ly/imdbratings',nrows=3).shape

(3, 6)

# iterate over dataframe

In [81]:
#for index, row in ufo.iterrows():
#    print (index , row.City , row.State )

In [161]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [85]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [86]:
import numpy as np

In [89]:
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [96]:
print drinks.mean(axis=0).shape
print drinks.mean(axis=1).shape

(4,)
(193,)

# String methods in pandas

In [97]:
orders = pd.read_table('http://bit.ly/chiporders')

In [98]:
orders.item_name.str.upper().head()

0             CHIPS AND FRESH TOMATO SALSA
1                                     IZZE
2                         NANTUCKET NECTAR
3    CHIPS AND TOMATILLO-GREEN CHILI SALSA
4                             CHICKEN BOWL
Name: item_name, dtype: object

In [104]:
order[orders.item_name.str.contains('Chicken')].head()

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25

In [105]:
orders.choice_description.str.replace('[','').str.replace(']','').head()

0                                                  NaN
1                                           Clementine
2                                                Apple
3                                                  NaN
4    Tomatillo-Red Chili Salsa (Hot), Black Beans, ...
Name: choice_description, dtype: object

In [107]:
orders.choice_description.str.replace('[\[\]]','').head()

0                                                  NaN
1                                           Clementine
2                                                Apple
3                                                  NaN
4    Tomatillo-Red Chili Salsa (Hot), Black Beans, ...
Name: choice_description, dtype: object

# How do I change the data type

In [109]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [110]:
drinks.beer_servings.astype(float).dtypes

dtype('float64')

In [ ]:
drinks = pd.read_csv('',dtype={'beer_servings':float})

In [112]:
orders.item_price.head()

0     $2.39
1     $3.39
2     $3.39
3     $2.39
4    $16.98
Name: item_price, dtype: object

In [ ]:
orders.item_price.str.replace('$','').mean() # not work

In [114]:
orders.item_price.str.replace('$','').astype(float).mean()

7.4643357853742973

In [116]:
orders.item_name.str.contains('Chicken').astype(int).head()

0    0
1    0
2    0
3    0
4    1
Name: item_name, dtype: int64

# Groupby in pandas

In [119]:
drinks.beer_servings.mean(axis=0)

106.16062176165804

In [123]:
drinks.groupby('continent').beer_servings.mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [125]:
drinks[drinks.continent=='Europe'].beer_servings.mean()

193.77777777777777

In [126]:
drinks.groupby('continent').beer_servings.agg(['count','min','max','mean'])

               count  min  max        mean
continent
Africa            53    0  376   61.471698
Asia              44    0  247   37.045455
Europe            45    0  361  193.777778
North America     23    1  285  145.434783
Oceania           16    0  306   89.687500
South America     12   93  333  175.083333

# How do I explore pandas

In [129]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [131]:
movies.genre.describe()

count       979
unique       16
top       Drama
freq        278
Name: genre, dtype: object

In [133]:
movies.genre.value_counts().head(2)

Drama     278
Comedy    156
Name: genre, dtype: int64

In [135]:
movies.genre.value_counts(normalize=True).head()

Drama        0.283963
Comedy       0.159346
Action       0.138917
Crime        0.126660
Biography    0.078652
Name: genre, dtype: float64

In [137]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [138]:
movies.genre.nunique()

16

In [139]:
pd.crosstab(movies.genre,movies.content_rating)

content_rating,APPROVED,G,GP,NC-17,NOT RATED,PASSED,PG,PG-13,R,TV-MA,UNRATED,X
genre,,,,,,,,,,,,
Action,3,1,1,0,4,1,11,44,67,0,3,0
Adventure,3,2,0,0,5,1,21,23,17,0,2,0
Animation,3,20,0,0,3,0,25,5,5,0,1,0
Biography,1,2,1,0,1,0,6,29,36,0,0,0
Comedy,9,2,1,1,16,3,23,23,73,0,4,1
Crime,6,0,0,1,7,1,6,4,87,0,11,1
Drama,12,3,0,4,24,1,25,55,143,1,9,1
Family,0,1,0,0,0,0,1,0,0,0,0,0
Fantasy,0,0,0,0,0,0,0,0,1,0,0,0
Film-Noir,1,0,0,0,1,0,0,0,0,0,1,0
History,0,0,0,0,0,0,0,0,0,0,1,0
Horror,2,0,0,1,1,0,1,2,16,0,5,1
Mystery,4,1,0,0,1,0,1,2,6,0,1,0
Sci-Fi,1,0,0,0,0,0,0,1,3,0,0,0
Thriller,1,0,0,0,0,0,1,0,3,0,0,0
Western,1,0,0,0,2,0,2,1,3,0,0,0

In [144]:
movies.content_rating.nunique()

12

In [147]:
movies.duration.describe()

count    979.000000
mean     120.979571
std       26.218010
min       64.000000
25%      102.000000
50%      117.000000
75%      134.000000
max      242.000000
Name: duration, dtype: float64

In [150]:
movies[1:2]

,star_rating,title,content_rating,genre,duration,actors_list
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"

# Index

In [156]:
drinks[drinks.continent == 'South America'][0:3]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America

In [194]:
drinks.loc[23,'beer_servings']

245

In [162]:
drink = drinks.set_index("country")

In [164]:
drink.head(2)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe

In [167]:
drink.loc['India','beer_servings']

9

In [172]:
# country -- is an name of index
drink.head(2)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe

In [170]:
drink.index.name= None

In [174]:
drink.index.name='country'

In [175]:
drink.reset_index(inplace = True)
drink.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [178]:
drink.continent.value_counts().head()

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
Name: continent, dtype: int64

## Creataing series

In [179]:
people = pd.Series([300,100],index=['India','Japan'],name='population')

In [182]:
people.head()
drink.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [190]:
#drink.set_index('country',inplace=True)
#print drink.head()

In [192]:
(drink.beer_servings * people).loc['India']

2700.0

## Concatenate DataFrames

In [196]:
pd.concat([drink,people],axis=1).loc['India','population']

300.0

# Select multiple rows and column

In [199]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [200]:
ufo.loc[0,:] # loc[ROW,COL]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Name: 0, dtype: object

In [201]:
ufo.loc[[1,2,3],:]

          City Colors Reported Shape Reported State             Time
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

In [202]:
ufo.loc[0:2,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [204]:
ufo.loc[1:2,['City','State']]

          City State
1  Willingboro    NJ
2      Holyoke    CO

In [206]:
ufo.loc[1:2,'City':'State']

          City Colors Reported Shape Reported State
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

In [207]:
#ufo[ufo.City=='Oakland']
ufo.loc[ufo.City=='Oakland','State'].head()

1694    CA
2144    CA
4686    MD
7293    CA
8488    CA
Name: State, dtype: object

### iloc - filtering row and column with integer

In [209]:
ufo.iloc[:,[0,3]].head(2)

          City State
0       Ithaca    NY
1  Willingboro    NJ

In [211]:
ufo.iloc[:,0:4].head(2)

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ

In [212]:
ufo.iloc[0:3,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [214]:
ufo[['City','State']].head(2)

          City State
0       Ithaca    NY
1  Willingboro    NJ

In [219]:
ufo[[1,2,3]].head(2)

  Colors Reported Shape Reported State
0             NaN       TRIANGLE    NY
1             NaN          OTHER    NJ

### ix - mix labels with integer

In [220]:
drink.ix['Albania',0]

89

In [222]:
drink.ix[1,'beer_servings']

89

In [224]:
drink.ix['India':'Japan',0:2].head()

           beer_servings  spirit_servings
country
India                  9              114
Indonesia              5                1
Iran                   0                0
Iraq                   9                3
Ireland              313              118

In [227]:
ufo.ix[0:2,0:2] # index both inclus ; But column are strings so outside one exclude

          City Colors Reported
0       Ithaca             NaN
1  Willingboro             NaN
2      Holyoke             NaN